/*********************************************************************************************************************
*
* @file             ldh_driver_light.c
* @author           刘冬华(QQ2448544676)
* @Software         MDK V5
* @Target core      STM32F407xx
* @date             2023-01-02
* @note             接线定义：
*                   ------------------------------------
*                   模块管脚            单片机管脚
*                   DAT					PA5
*                   电源引脚
*                   VCC                 3.3V电源
*                   GND                 电源地
*                   ------------------------------------
********************************************************************************************************************/

#include "ldh_driver_light.h"

int ldh_light = 0;

//-------------------------------------------------------------------------------------------------------------------
// @brief       光敏传感器采集数据函数
// @return      0-255的光照数据
//-------------------------------------------------------------------------------------------------------------------
uint8_t get_light(void)
{
	int AD_Light = 0,mide_temp = 0;

	HAL_ADC_Start(&LIGHT_ADC);		//启动ADC转换
	HAL_ADC_PollForConversion(&LIGHT_ADC, 50);//表示等待转换完成，第二个参数表示超时时间，单位ms
	
	if(HAL_IS_BIT_SET(HAL_ADC_GetState(&LIGHT_ADC), HAL_ADC_STATE_REG_EOC))//获取ADC状态。判断转换完成标志位是否设置
	{
		AD_Light=HAL_ADC_GetValue(&LIGHT_ADC);//读取ADC转换数据
		mide_temp = AD_Light*255/4096;
		AD_Light = 255-mide_temp;
	}
	return AD_Light;
}
